---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationHostedInfo Properties
FabricationHostedInfo Class See Also Send Feedback
---

The FabricationHostedInfo type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | HostId | Returns the identifier of the host. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FabricationHostedInfo Class

Autodesk.Revit.DB Namespace